{
    "hard": [
        ""
    ],
    "medium": [
        "These reflections have dispelled the agitation with which I began my letter, and I feel my heart glow with an enthusiasm which elevates me to heaven, for nothing contributes so much to tranquillise the mind as a steady purpose—a point on which the soul may fix its intellectual eye",
        "I cannot describe to you my sensations on the near prospect of my undertaking. It is impossible to communicate to you a conception of the trembling sensation, half pleasurable and half fearful, with which I am preparing to depart.",
        "The door of Scrooge's counting-house was open that he might keep his eye upon his clerk, who in a dismal little cell beyond, a sort of tank, was copying letters.",
        ""
    ],
    "easy": [
        "The funny monkey eats a banana.",
        "I see a yellow school bus on the road.",
        "Bouncing balls make happy children laugh.",
        "Graceful dolphins swim in the deep ocean.",
        "The brave knight rides a strong horse.",
        "Giggling babies crawl on the soft carpet.",
        "Cheerful flowers bloom in the spring garden.",
        "Silly squirrels play in the tall trees.",
        "Crispy popcorn pops in the movie theater.",
        "Whistling wind blows through the open window.",
        "Purring kittens nap in a cozy basket.",
        "Twinkling stars shine in the dark night sky.",
        "Clever foxes hide in the thick forest.",
        "Jolly elves dance around the festive tree.",
        "Sparkling water flows in the clear river.",
        "Brisk wind blows colorful leaves off trees.",
        "Gentle waves wash up on the sandy beach.",
        "Happy families picnic in the green park.",
        "Fluffy marshmallows float in hot cocoa.",
        "Tricky ghosts haunt the old, spooky mansion.",
        "Buzzy bees buzz around blooming flowers.",
        "Chirping crickets sing in the quiet night.",
        "Soft raindrops fall on the tin roof.",
        "Whimsical fairies dance in the moonlight.",
        "The kind wizard casts a magical spell.",
        "Zigzag lightning lights up the stormy sky.",
        "Sneaky pirates search for buried treasure.",
        "The wise owl hoots in the dark forest.",
        "Loud thunder rumbles during the storm.",
        "Funky music plays at the lively party.",
        "The gigantic dinosaur roars loudly.",
        "Creaking doors open in the haunted house.",
        "Busy bees buzz around the blooming flowers.",
        "Quacking ducks swim in the peaceful pond.",
        "Dancing flames flicker in the cozy fireplace.",
        "The playful puppy chases its wagging tail.",
        "Sizzling sausages cook on the hot grill.",
        "The shiny rainbow appears after the rain.",
        "The mighty lion roars in the wild jungle.",
        "The speedy race car zooms around the track.",
        "Glowing fireflies light up the summer night.",
        "Bubbly soap bubbles float in the air.",
        "The chirpy cricket plays its tiny violin.",
        "The sleepy bear snores in its cozy cave.",
        "Happy giggles echo in the playground.",
        "Gentle waves lap against the rocky shore.",
        "Whirling tornadoes spin in the stormy sky.",
        "The chirpy robin sings a sweet melody.",
        "The buzzing bee collects nectar from flowers."
    ]
}

