{
    "hard": [
        "The philosopher postulates the inherent ambiguity of existential truth.",
        "In molecular biology, the intricate interplay of nucleotides governs genetic expression.",
        "Existential nihilism challenges traditional notions of meaning and purpose in life.",
        "The neuroscientist investigates the neuroplasticity of the brain in response to environmental stimuli.",
        "Einstein's theory of relativity revolutionized our understanding of spacetime.",
        "Heisenberg's uncertainty principle posits fundamental limits to simultaneous measurements.",
        "The juxtaposition of disparate ideologies fuels dialectical discussions in political philosophy.",
        "In neurophysiology, synaptic plasticity underlies learning and memory processes.",
        "Astronomers study celestial phenomena to unravel the mysteries of the universe.",
        "The ontological argument delves into the nature of existence and the concept of a necessary being.",
        "In ecology, trophic cascades influence the dynamics of entire ecosystems.",
        "The biophysicist elucidates the principles of protein folding and conformational dynamics.",
        "The paradox of free will explores the tension between determinism and human agency.",
        "In anthropology, cultural relativism challenges ethnocentric perspectives.",
        "The linguist analyzes the intricate syntax and semantics of human language.",
        "Quantum entanglement involves correlations between particles transcending classical physics.",
        "The neuroethicist examines ethical implications of emerging neurotechnologies.",
        "The deconstructionist questions the stability and fixed meanings of language.",
        "In immunology, antibodies confer adaptive immunity by recognizing specific antigens.",
        "The political theorist critiques the implications of power structures in modern democracies.",
        "Eukaryotic cells exhibit compartmentalization through membrane-bound organelles.",
        "The existentialist contends with the absurdity of human existence and the quest for meaning.",
        "In genetics, epistasis modulates the phenotypic expression of genes.",
        "The cognitive psychologist investigates the neural substrates of decision-making processes.",
        "The Bayesian framework provides a probabilistic approach to statistical inference.",
        "The bioinformatician utilizes algorithms to analyze vast genomic datasets.",
        "In moral philosophy, deontology and utilitarianism offer distinct ethical frameworks.",
        "The physicist explores the implications of quantum superposition in particle physics.",
        "The ecological footprint assesses human impact on the environment.",
        "The hermeneutic philosopher interprets texts with a focus on historical context.",
        "In pharmacology, the pharmacokinetics of drugs involves absorption, distribution, metabolism, and excretion.",
        "The archaeologist excavates artifacts to reconstruct ancient civilizations.",
        "The biogerontologist studies the biology of aging and potential interventions.",
        "The neurophenomenologist investigates the relationship between consciousness and neural processes.",
        "In ethics, virtue ethics emphasizes the cultivation of moral character.",
        "The existentialist contends with the inherent responsibility of individual choices.",
        "The paleontologist examines fossilized remains to trace evolutionary lineages.",
        "The semiotician analyzes signs and symbols to understand meaning in communication.",
        "In neurology, the prefrontal cortex plays a crucial role in executive functions.",
        "The astrophysicist explores the cosmic microwave background to understand the early universe.",
        "In sociology, structural functionalism examines the roles of institutions in societal stability.",
        "The philosopher critiques the foundational assumptions of logical positivism.",
        "The immunologist investigates the role of cytokines in immune responses.",
        "In political economy, neoliberalism advocates for limited government intervention in markets.",
        "The cognitive neuroscientist explores the neural correlates of consciousness.",
        "The phenomenologist examines lived experiences to elucidate subjective meaning.",
        "The evolutionary biologist studies adaptive radiation to explain species diversification."
    ],
    "medium": [
        "The erudite professor elucidates complex theories in the lecture hall.",
        "In the realm of quantum physics, particles exhibit perplexing behaviors.",
        "The astute entrepreneur formulates a strategic business plan.",
        "The eloquent orator delivers a discourse on socio-economic disparities.",
        "A profound philosophical discourse explores the nature of existence.",
        "The intrepid journalist investigates clandestine government activities.",
        "The polymathic scholar excels in various academic disciplines.",
        "The erudite author crafts a compelling narrative with intricate plot twists.",
        "In the field of genetic research, scientists decode the human genome.",
        "The adept mathematician solves convoluted equations with ease.",
        "A poignant literary work delves into the intricacies of human relationships.",
        "The perspicacious detective unravels enigmatic criminal mysteries.",
        "In the hallowed halls of academia, rigorous debates shape intellectual discourse.",
        "A virtuoso pianist performs a sonata with unparalleled skill and emotion.",
        "The avant-garde artist challenges societal norms through provocative creations.",
        "The discerning critic analyzes subtle nuances in cinematic masterpieces.",
        "The erudite linguist deciphers ancient scripts and languages.",
        "In the complex world of international relations, diplomacy plays a pivotal role.",
        "A sagacious mentor imparts wisdom to aspiring scholars.",
        "The seasoned economist formulates policies to address economic challenges.",
        "The audacious explorer embarks on a perilous expedition to uncharted territories.",
        "A groundbreaking scientific discovery revolutionizes our understanding of the universe.",
        "The erudite philosopher contemplates the intersection of morality and ethics.",
        "A prodigious composer creates symphonies that resonate with profound emotion.",
        "In the cutting-edge laboratory, researchers pioneer advancements in medical science.",
        "The eloquent statesman negotiates delicate diplomatic agreements.",
        "A pioneering architect designs structures that blend aesthetics with functionality.",
        "The astrophysicist explores the cosmos, unraveling the mysteries of black holes.",
        "A seasoned historian chronicles the intricacies of ancient civilizations.",
        "The virtuoso violinist captivates audiences with a flawless performance.",
        "In the dynamic realm of artificial intelligence, algorithms evolve and adapt.",
        "The erudite anthropologist studies cultural shifts and societal dynamics.",
        "A masterful playwright crafts narratives that challenge societal norms.",
        "The seasoned surgeon performs intricate procedures with meticulous precision.",
        "A virtuoso chess player strategizes with foresight and cunning.",
        "In the political arena, charismatic leaders navigate complex geopolitical landscapes.",
        "A trailblazing environmentalist advocates for sustainable practices.",
        "The sagacious philosopher reflects on the nature of consciousness and reality.",
        "The enterprising entrepreneur pioneers disruptive innovations in technology.",
        "A prolific author pens novels that explore the complexities of the human psyche.",
        "The audacious aviator pushes the boundaries of aeronautical exploration.",
        "In the realm of artificial intelligence, neural networks simulate human cognition.",
        "A pioneering ecologist studies ecosystems to inform conservation efforts.",
        "The erudite jurist interprets intricate legal statutes with scholarly acumen.",
        "A virtuoso guitarist mesmerizes audiences with intricate solos and harmonies.",
        "In the expansive field of astrophysics, researchers seek to unravel cosmic mysteries.",
        "The discerning art critic analyzes the cultural significance of avant-garde installations.",
        "A seasoned archaeologist excavates ancient artifacts to reconstruct historical narratives."
    ],
    "easy": [
        "The funny monkey eats a banana.",
        "I see a yellow school bus on the road.",
        "Bouncing balls make happy children laugh.",
        "Graceful dolphins swim in the deep ocean.",
        "The brave knight rides a strong horse.",
        "Giggling babies crawl on the soft carpet.",
        "Cheerful flowers bloom in the spring garden.",
        "Silly squirrels play in the tall trees.",
        "Crispy popcorn pops in the movie theater.",
        "Whistling wind blows through the open window.",
        "Purring kittens nap in a cozy basket.",
        "Twinkling stars shine in the dark night sky.",
        "Clever foxes hide in the thick forest.",
        "Jolly elves dance around the festive tree.",
        "Sparkling water flows in the clear river.",
        "Brisk wind blows colorful leaves off trees.",
        "Gentle waves wash up on the sandy beach.",
        "Happy families picnic in the green park.",
        "Fluffy marshmallows float in hot cocoa.",
        "Tricky ghosts haunt the old, spooky mansion.",
        "Chirping crickets sing in the quiet night.",
        "Soft raindrops fall on the tin roof.",
        "Whimsical fairies dance in the moonlight.",
        "The kind wizard casts a magical spell.",
        "Zigzag lightning lights up the stormy sky.",
        "Sneaky pirates search for buried treasure.",
        "The wise owl hoots in the dark forest.",
        "Loud thunder rumbles during the storm.",
        "Funky music plays at the lively party.",
        "The gigantic dinosaur roars loudly.",
        "Creaking doors open in the haunted house.",
        "Busy bees buzz around the blooming flowers.",
        "Quacking ducks swim in the peaceful pond.",
        "Dancing flames flicker in the cozy fireplace.",
        "The playful puppy chases its wagging tail.",
        "Sizzling sausages cook on the hot grill.",
        "The shiny rainbow appears after the rain.",
        "The mighty lion roars in the wild jungle.",
        "The speedy race car zooms around the track.",
        "Glowing fireflies light up the summer night.",
        "Bubbly soap bubbles float in the air.",
        "The chirpy cricket plays its tiny violin.",
        "The sleepy bear snores in its cozy cave.",
        "Happy giggles echo in the playground.",
        "Gentle waves lap against the rocky shore.",
        "Whirling tornadoes spin in the stormy sky.",
        "The chirpy robin sings a sweet melody.",
        "The buzzing bee collects nectar from flowers."
    ]
}

